[{"id":541,"title":"ES6 en pratique","summary":"Mise en avant d\u0027extraits de JavaScript à la sauce ES6 pour donner envie d\u0027essayer cette nouvelle version","description":"L\u0027idée est de présenter quelques fonctionnalités de la prochaine version de JavaScript (appelée ES6, ou encore parfois JavaScript.next() ou Harmony).\r\n\r\nAfin de coller avec le format, les fonctionnalités seront choisies selon leur intérêt, la facilité à les comprendre rapidement et leur support dans les navigateurs / JS côté serveur. Chaque fonctionnalité sera présentée avec un exemple de code \"ancienne version\" et un autre \"nouvelle version\" montrant un gain en lisibilité / expressivité, ainsi que des informations concernant son support.\r\n\r\nEn pratique, le talk débutera par une présentation rapide de ce qu\u0027est ES6 (1min), suivi des fonctionnalités (probablement au nombre de trois, 3min), suivi d\u0027une vue d\u0027ensemble des solutions pour essayer ES6 soi-même (Node --harmony, Chrome 35+, Traceur Compiler, 1min).\r\n\r\nJ\u0027ai déjà présenté devant de petites audiences (20-30pers) dans un cadre professionnel et dans certains User Group de Montpellier. Avant la conférence, ce talk sera présenté en version allongée à mes collègues de travail.\r\n\r\nNB : le titre pourrait être ajusté selon l\u0027inspiration du moment (\"ES6 en pratique\", \"ES6 en bref\", \"ES6 pour de vrai\", etc).","language":"fr","interests":[5,898,897,899],"speakers":[1070],"nbVotes":20},{"id":543,"title":"Blogger chaque jour pour être riche et célèbre","summary":"Comment devenir riche et célèbre, un jour à la fois, un acticle à la fois.","description":"Je vous propose un bilan, que j\u0027espère humoristique, de mon expérience qui consiste, depuis deux mois, à écrire un blog post par jour. Cela sera l\u0027occasion de vous dévoiler mes ficelles et mes outils. De vous expliquer ce que cette discipline me donne en retour (richesse et célébrité ?). Mais aussi de partager ma détresse. Depuis deux mois, je ne dors plus ni ne mange, accaparé par l\u0027écriture de nouveaux articles.","language":"fr","interests":[908,907,909,910],"speakers":[991],"nbVotes":25},{"id":544,"title":"De l\u0027architecture dans les CSS","summary":"Comment vivre avec ses CSS sur le long terme, quand toute votre équipe met le nez dedans !","description":"Présentation de la stack Grunt (relative aux CSS) d\u0027un site grand public.\r\nEt en particulier d\u0027un plugin Grunt nous permettant de gérer une architecture dans nos fichiers CSS.","language":"fr","interests":[572,658,287,569,153],"speakers":[997],"nbVotes":12},{"id":545,"title":"#Restful, really ?","summary":"Tout le monde dit faire ou vouloir faire une architecture de type Rest, mais qu\u0027est-ce que cela implique-t-il vraiment ?","description":"Tout le monde dit faire ou vouloir faire une architecture de type Rest, mais qu\u0027est-ce que cela implique-t-il vraiment ?\r\n\r\nOù vous situez-vous sur le \"Richardson Maturity Model\" ? Votre API est à la fois Hypermedia et JSON ? « Are you kidding ? » \r\n\r\nSi ce sont des questions qui vous taraudent l\u0027esprit et même vous empêchent de dormir, alors venez écouter ce talk pour avoir des pistes de réflexions, des échanges et peut-être des réponses, qui sait ?\r\n","language":"fr","interests":[911,240,241,135],"speakers":[977],"nbVotes":10},{"id":546,"title":"Gradle. Thèse, antithèse et synthèse.","summary":"Un (rapide) tour des avantages et inconvénients de Gradle","description":"Sur le projet ProActive, porté par Activeeon, nous avons récemment migré notre build de Ant vers Gradle en laissant de côté Maven. \r\n\r\nJe souhaite échanger sur cette migration en évoquant les avantages et inconvénients de chacun de ces outils. Ce sera l\u0027occasion de présenter notre démarche, les motivations qui nous ont amené à choisir Gradle mais aussi les problèmes que nous avons rencontrés. En cinq minutes il sera difficile de tout dire sur Gradle mais j\u0027espère vous donner l\u0027envie de tester cet outil de build moderne et puissant tout en restant pragmatique.","language":"fr","interests":[719,659,720,130,166],"speakers":[89],"nbVotes":8},{"id":547,"title":"Ansible, la gestion de configuration facile","summary":"Introducation à Ansible, outil de gestion de configuration simple","description":"Ansible est un outil de gestion de configuration dans la veine de Puppet et Chef. Destiné aux devops, il est particulièrement simple à utiliser et rapide à prendre à main.\r\nCinq minutes c\u0027est largement suffisant pour présenter les concepts de l\u0027outil, quelques exemples et une démo !","language":"fr","interests":[481],"speakers":[89],"nbVotes":8},{"id":548,"title":"Ateliers de code pour enfants et ukulélé rose","summary":"Animer un atelier pour enfants et utiliser un ukulélé rose, c\u0027est pareil. Et ce n\u0027est absolument pas une plaisanterie.","description":"Musicien et codeur, ce n\u0027est pas toujours une situation exceptionnelle, nous sommes nombreux dans ce cas.\r\nIl est parfois possible de trouver des parallèles entre les deux mondes.\r\n\r\nLorsque je me suis lancé à participer à des ateliers de code pour enfants, les sensations que j\u0027ai eu m\u0027ont rappelé une situation que j\u0027avais déjà vécue dans mon expérience musicale.\r\n\r\nLe rapport avec un ukulélé ?\r\nUn ukulélé rose ?\r\n\r\nLà, il va falloir voter dur pour mon lightning pour que je vienne vous expliquer ça en 5 minutes ;)","language":"fr","interests":[810,206,352],"speakers":[33],"nbVotes":7},{"id":549,"title":"Gamification et communauté Open Source ","summary":"REX sur la gamification dans une communauté Open Source","description":"Une des problématiques dans les communautés Open Source est de valoriser et d\u0027impliquer les contributeurs.\r\nLa gamification permet en détournant les mécanismes humain du jeu de résoudre en partie ce problème.\r\n\r\n[Mozilla badges](http://openbadges.org/) est un standard ouvert et intéropérables de système de reconnaissance.\r\nLe lightning présentera également son implémentation au sein de la communauté fedoraproject.org et les premiers retours d\u0027expériences:\r\nhttp://badges.fedoraproject.org/","language":"fr","interests":[738,804,808],"speakers":[152],"nbVotes":8},{"id":550,"title":"Quatre mois hors du guidon","summary":"Profiter du congé maternité pour décrocher vraiment… et mieux raccrocher après","description":"Un congé maternité, c\u0027est seize semaines pour un premier bébé. Un peu moins de quatre mois.\r\nC\u0027est court… mais c\u0027est assez long quand même, pour une pause.\r\nDonnez-moi cinq minutes pour vous parler de ce que j\u0027ai trouvé pour faire profiter mon boulot de cette longue pause.\r\n\r\nSortir la tête du guidon puis revenir en étant devenu parent, ça donne un regard tout neuf sur le travail, le produit… On a les super pouvoirs du nouveau venu et la vision de l\u0027historique en même temps. Ce serait dommage de ne pas profiter de ce mélange détonnant !","language":"fr","interests":[916,917,915,913,914],"speakers":[1032],"nbVotes":7},{"id":551,"title":"La grammaire est une chanson douce","summary":"Il y a un moment où il faut arrêter les fautes de niveau CE2, hein.","description":"C\u0027est difficile de donner un cours de français en 5 minutes, alors je vais plutôt vous donner quelques astuces mnémotechniques efficaces pour éviter les fautes les plus énervantes/graves croisées sur le grand web francophone.\r\n\r\nEt en passant, je ferai le tour de quelques initiatives intéressantes que j\u0027ai croisées çà et là pour aider les gens qui ne vont plus à l\u0027école à améliorer leur français écrit.","language":"fr","interests":[921,918,920,919],"speakers":[1032],"nbVotes":4},{"id":552,"title":"REX Lean startup","summary":"REX Lean startup","description":"Retour d\u0027expérience d\u0027un petit projet perso crée il y a 10 mois en lean startup sauvage. Je ne suis pas milliardaire en euros mais j\u0027ai appris plein de choses. J\u0027espère évoquer une ou deux idées en 5 mn de lightning talks.\r\n\r\nAujourd\u0027hui, ce side project\r\n* draine ~20 000 visiteurs par mois sur le site\r\n* fait attendre 271 personnes intéressées par une application mobile\r\n* fait testé une version Android à 15 personnes\r\n* est rentré dans ses frais (pour encore quelques mois)","language":"fr","interests":[35],"speakers":[1016],"nbVotes":1}]